## 🏗️ Terraform Plan - `staging` Environment

### Workflow Status
| Step | Status |
|------|--------|
| 🖌️ Format | ✅ |
| ⚙️ Init | ✅ |
| ✅ Validate | ✅ |
| 📖 Plan | ✅ |
| 🔒 Security Scan | ✅ |

### Resource Changes
| Action | Count |
|--------|-------|
| 🟢 Create | 45 |
| 🟡 Update | 0 |
| 🔴 Delete | 0 |

<details>
<summary>📋 Show Full Plan</summary>

```hcl

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.acr.azurerm_container_registry.main has been deleted
  - resource "azurerm_container_registry" "main" {
      - id                            = "/subscriptions/f437c82a-c093-4ba0-b505-1bcf13d07af8/resourceGroups/banking-staging-rg/providers/Microsoft.ContainerRegistry/registries/bankingstagingbkil9facr" -> null
      - login_server                  = "bankingstagingbkil9facr.azurecr.io" -> null
      - name                          = "bankingstagingbkil9facr" -> null
        tags                          = {
            "CostCenter"  = "staging"
            "Environment" = "staging"
            "ManagedBy"   = "Terraform"
            "Owner"       = "devops@company.com"
            "Project"     = "banking"
        }
        # (15 unchanged attributes hidden)
    }

  # module.aks.azurerm_kubernetes_cluster.main has been deleted
  - resource "azurerm_kubernetes_cluster" "main" {
      - fqdn                                = "banking-staging-t1bqlljs.hcp.eastus.azmk8s.io" -> null
      - id                                  = "/subscriptions/f437c82a-c093-4ba0-b505-1bcf13d07af8/resourceGroups/banking-staging-rg/providers/Microsoft.ContainerService/managedClusters/banking-staging-aks" -> null
      - kube_admin_config_raw               = (sensitive value) -> null
      - kube_config                         = (sensitive value) -> null
      - kube_config_raw                     = (sensitive value) -> null
      - name                                = "banking-staging-aks" -> null
      - node_resource_group                 = "banking-staging-aks-nodes-rg" -> null
      - oidc_issuer_url                     = "https://eastus.oic.prod-aks.azure.com/52021890-a859-400c-a8e2-62d0c85d5e66/7bcc7aee-afec-4ffc-bde0-23a04e5c767f/" -> null
      - private_fqdn                        = "banking-staging-bttifhy8.ba4e8a89-2e9a-44ef-a235-ab0092ecfcca.privatelink.eastus.azmk8s.io" -> null
        tags                                = {
            "CostCenter"  = "staging"
            "Environment" = "staging"
            "ManagedBy"   = "Terraform"
            "Owner"       = "devops@company.com"
            "Project"     = "banking"
        }
        # (29 unchanged attributes hidden)

      - kubelet_identity {
          - object_id                 = "347881fa-5bc4-4437-b967-ed6d22078ae7" -> null
            # (2 unchanged attributes hidden)
        }

        # (9 unchanged blocks hidden)
    }

  # module.aks.azurerm_user_assigned_identity.aks has been deleted
  - resource "azurerm_user_assigned_identity" "aks" {
      - id                  = "/subscriptions/f437c82a-c093-4ba0-b505-1bcf13d07af8/resourceGroups/banking-staging-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/banking-staging-aks-identity" -> null
        name                = "banking-staging-aks-identity"
      - principal_id        = "9e68af26-3ddb-4009-8ebe-37cf21e86b71" -> null
        tags                = {
            "CostCenter"  = "staging"
            "Environment" = "staging"
            "ManagedBy"   = "Terraform"
            "Owner"       = "devops@company.com"
            "Project"     = "banking"
        }
        # (4 unchanged attributes hidden)
    }

  # module.keyvault.azurerm_key_vault.main has been deleted
  - resource "azurerm_key_vault" "main" {
      - id                              = "/subscriptions/f437c82a-c093-4ba0-b505-1bcf13d07af8/resourceGroups/banking-staging-rg/providers/Microsoft.KeyVault/vaults/banking-stg-kv-bkil9f" -> null
      - name                            = "banking-stg-kv-bkil9f" -> null
        tags                            = {
            "CostCenter"  = "staging"
            "Environment" = "staging"
            "ManagedBy"   = "Terraform"
            "Owner"       = "devops@company.com"
            "Project"     = "banking"
        }
      - tenant_id                       = "52021890-a859-400c-a8e2-62d0c85d5e66" -> null
      - vault_uri                       = "https://banking-stg-kv-bkil9f.vault.azure.net/" -> null
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.monitoring.azurerm_log_analytics_workspace.main has been deleted
  - resource "azurerm_log_analytics_workspace" "main" {
      - id                                      = "/subscriptions/f437c82a-c093-4ba0-b505-1bcf13d07af8/resourceGroups/banking-staging-rg/providers/Microsoft.OperationalInsights/workspaces/banking-staging-law" -> null
      - name                                    = "banking-staging-law" -> null
      - primary_shared_key                      = (sensitive value) -> null
      - secondary_shared_key                    = (sensitive value) -> null
        tags                                    = {
            "CostCenter"  = "staging"
            "Environment" = "staging"
            "ManagedBy"   = "Terraform"
            "Owner"       = "devops@company.com"
            "Project"     = "banking"
        }
        # (12 unchanged attributes hidden)
    }

  # module.monitoring.azurerm_monitor_action_group.critical has been deleted
  - resource "azurerm_monitor_action_group" "critical" {
      - id                  = "/subscriptions/f437c82a-c093-4ba0-b505-1bcf13d07af8/resourceGroups/banking-staging-rg/providers/Microsoft.Insights/actionGroups/banking-staging-critical-ag" -> null
        name                = "banking-staging-critical-ag"
        tags                = {
            "CostCenter"  = "staging"
            "Environment" = "staging"
            "ManagedBy"   = "Terraform"
            "Owner"       = "devops@company.com"
            "Project"     = "banking"
        }
        # (4 unchanged attributes hidden)
    }

  # module.monitoring.azurerm_monitor_action_group.warning has been deleted
  - resource "azurerm_monitor_action_group" "warning" {
      - id                  = "/subscriptions/f437c82a-c093-4ba0-b505-1bcf13d07af8/resourceGroups/banking-staging-rg/providers/Microsoft.Insights/actionGroups/banking-staging-warning-ag" -> null
        name                = "banking-staging-warning-ag"
        tags                = {
            "CostCenter"  = "staging"
            "Environment" = "staging"
            "ManagedBy"   = "Terraform"
            "Owner"       = "devops@company.com"
            "Project"     = "banking"
        }
        # (4 unchanged attributes hidden)
    }

  # module.networking.azurerm_private_dns_zone.mysql has been deleted
  - resource "azurerm_private_dns_zone" "mysql" {
      - id                                                    = "/subscriptions/f437c82a-c093-4ba0-b505-1bcf13d07af8/resourceGroups/banking-staging-rg/providers/Microsoft.Network/privateDnsZones/privatelink.mysql.database.azure.com" -> null
      - name                                                  = "privatelink.mysql.database.azure.com" -> null
        tags                                                  = {
            "CostCenter"  = "staging"
            "Environment" = "staging"
            "ManagedBy"   = "Terraform"
            "Owner"       = "devops@company.com"
            "Project"     = "banking"
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.networking.azurerm_private_dns_zone_virtual_network_link.mysql has been deleted
  - resource "azurerm_private_dns_zone_virtual_network_link" "mysql" {
      - id                    = "/subscriptions/f437c82a-c093-4ba0-b505-1bcf13d07af8/resourceGroups/banking-staging-rg/providers/Microsoft.Network/privateDnsZones/privatelink.mysql.database.azure.com/virtualNetworkLinks/mysql-vnet-link" -> null
        name                  = "mysql-vnet-link"
        tags                  = {
            "CostCenter"  = "staging"
            "Environment" = "staging"
            "ManagedBy"   = "Terraform"
            "Owner"       = "devops@company.com"
            "Project"     = "banking"
        }
        # (4 unchanged attributes hidden)
    }

  # module.networking.azurerm_subnet.aks has been deleted
  - resource "azurerm_subnet" "aks" {
      - id                                             = "/subscriptions/f437c82a-c093-4ba0-b505-1bcf13d07af8/resourceGroups/banking-staging-rg/providers/Microsoft.Network/virtualNetworks/banking-staging-vnet/subnets/banking-staging-aks-subnet" -> null
        name                                           = "banking-staging-aks-subnet"
        # (11 unchanged attributes hidden)
    }

  # module.networking.azurerm_virtual_network.main has been deleted
  - resource "azurerm_virtual_network" "main" {
      - id                      = "/subscriptions/f437c82a-c093-4ba0-b505-1bcf13d07af8/resourceGroups/banking-staging-rg/providers/Microsoft.Network/virtualNetworks/banking-staging-vnet" -> null
      - name                    = "banking-staging-vnet" -> null
        tags                    = {
            "CostCenter"  = "staging"
            "Environment" = "staging"
            "ManagedBy"   = "Terraform"
            "Owner"       = "devops@company.com"
            "Project"     = "banking"
        }
        # (7 unchanged attributes hidden)
    }

  # module.resource_group.azurerm_resource_group.main has been deleted
  - resource "azurerm_resource_group" "main" {
      - id       = "/subscriptions/f437c82a-c093-4ba0-b505-1bcf13d07af8/resourceGroups/banking-staging-rg" -> null
      - location = "eastus" -> null
      - name     = "banking-staging-rg" -> null
        tags     = {
            "CostCenter"  = "staging"
            "Environment" = "staging"
            "ManagedBy"   = "Terraform"
            "Owner"       = "devops@company.com"
            "Project"     = "banking"
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.acr.azurerm_container_registry.main will be created
  + resource "azurerm_container_registry" "main" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + anonymous_pull_enabled        = false
      + data_endpoint_enabled         = true
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "eastus"
      + login_server                  = (known after apply)
      + name                          = "bankingstagingbkil9facr"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = [
          + {
              + default_action = "Deny"
            },
        ]
      + public_network_access_enabled = false
      + quarantine_policy_enabled     = false
      + resource_group_name           = "banking-staging-rg"
      + retention_policy              = [
          + {
              + days    = 30
              + enabled = true
            },
        ]
      + sku                           = "Premium"
      + tags                          = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + trust_policy                  = [
          + {
              + enabled = true
            },
        ]
      + zone_redundancy_enabled       = false
    }

  # module.acr.azurerm_monitor_diagnostic_setting.acr[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "acr" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "bankingstagingbkil9facr-diagnostics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "ContainerRegistryLoginEvents"
        }
      + enabled_log {
          + category = "ContainerRegistryRepositoryEvents"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.acr.azurerm_private_endpoint.acr[0] will be created
  + resource "azurerm_private_endpoint" "acr" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = "bankingstagingbkil9facr-pe"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "banking-staging-rg"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "default"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "bankingstagingbkil9facr-psc"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "registry",
            ]
        }
    }

  # module.acr.null_resource.cleanup_acr_diagnostics[0] will be created
  + resource "null_resource" "cleanup_acr_diagnostics" {
      + id       = (known after apply)
      + triggers = {
          + "acr_id"          = (known after apply)
          + "diagnostic_name" = "bankingstagingbkil9facr-diagnostics"
        }
    }

  # module.aks.azurerm_kubernetes_cluster.main will be created
  + resource "azurerm_kubernetes_cluster" "main" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + automatic_channel_upgrade           = "stable"
      + azure_policy_enabled                = true
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "banking-staging"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.32"
      + location                            = "eastus"
      + name                                = "banking-staging-aks"
      + node_resource_group                 = "banking-staging-aks-nodes-rg"
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_enabled                 = true
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = true
      + private_cluster_public_fqdn_enabled = true
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "banking-staging-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Standard"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + workload_identity_enabled           = true

      + azure_active_directory_role_based_access_control {
          + admin_group_object_ids = []
          + azure_rbac_enabled     = true
          + managed                = true
          + tenant_id              = (known after apply)
        }

      + default_node_pool {
          + enable_auto_scaling          = true
          + kubelet_disk_type            = (known after apply)
          + max_count                    = 3
          + max_pods                     = 50
          + min_count                    = 1
          + name                         = "system"
          + node_count                   = 1
          + node_labels                  = {
              + "environment" = "staging"
              + "nodepool"    = "system"
            }
          + only_critical_addons_enabled = true
          + orchestrator_version         = (known after apply)
          + os_disk_size_gb              = 128
          + os_disk_type                 = "Managed"
          + os_sku                       = (known after apply)
          + scale_down_mode              = "Delete"
          + tags                         = {
              + "CostCenter"  = "staging"
              + "Environment" = "staging"
              + "ManagedBy"   = "Terraform"
              + "Owner"       = "devops@company.com"
              + "Project"     = "banking"
            }
          + type                         = "VirtualMachineScaleSets"
          + ultra_ssd_enabled            = false
          + vm_size                      = "Standard_DC2s_v3"
          + vnet_subnet_id               = (known after apply)
          + workload_runtime             = (known after apply)
          + zones                        = [
              + "3",
            ]

          + upgrade_settings {
              + max_surge = "33%"
            }
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + key_vault_secrets_provider {
          + secret_identity          = (known after apply)
          + secret_rotation_enabled  = true
          + secret_rotation_interval = "2m"
        }

      + network_profile {
          + dns_service_ip          = "10.100.0.10"
          + docker_bridge_cidr      = (known after apply)
          + ebpf_data_plane         = (known after apply)
          + ip_versions             = (known after apply)
          + load_balancer_sku       = "standard"
          + network_data_plane      = (known after apply)
          + network_mode            = (known after apply)
          + network_plugin          = "azure"
          + network_policy          = "azure"
          + outbound_ip_address_ids = (known after apply)
          + outbound_ip_prefix_ids  = (known after apply)
          + outbound_type           = "loadBalancer"
          + pod_cidr                = (known after apply)
          + pod_cidrs               = (known after apply)
          + service_cidr            = "10.100.0.0/16"
          + service_cidrs           = (known after apply)
        }

      + oms_agent {
          + log_analytics_workspace_id      = (known after apply)
          + msi_auth_for_monitoring_enabled = true
          + oms_agent_identity              = (known after apply)
        }
    }

  # module.aks.azurerm_monitor_diagnostic_setting.aks[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "aks" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "banking-staging-aks-diagnostics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "kube-apiserver"
        }
      + enabled_log {
          + category = "kube-audit"
        }
      + enabled_log {
          + category = "kube-audit-admin"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.aks.azurerm_role_assignment.aks_acr_pull[0] will be created
  + resource "azurerm_role_assignment" "aks_acr_pull" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aks.azurerm_role_assignment.aks_network_contributor will be created
  + resource "azurerm_role_assignment" "aks_network_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Network Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aks.azurerm_user_assigned_identity.aks will be created
  + resource "azurerm_user_assigned_identity" "aks" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "banking-staging-aks-identity"
      + principal_id        = (known after apply)
      + resource_group_name = "banking-staging-rg"
      + tags                = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + tenant_id           = (known after apply)
    }

  # module.aks.null_resource.cleanup_aks_diagnostics[0] will be created
  + resource "null_resource" "cleanup_aks_diagnostics" {
      + id       = (known after apply)
      + triggers = {
          + "aks_id"          = (known after apply)
          + "diagnostic_name" = "banking-staging-aks-diagnostics"
        }
    }

  # module.keyvault.azurerm_key_vault.main will be created
  + resource "azurerm_key_vault" "main" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = true
      + enabled_for_deployment          = false
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = false
      + id                              = (known after apply)
      + location                        = "eastus"
      + name                            = "banking-stg-kv-bkil9f"
      + public_network_access_enabled   = false
      + purge_protection_enabled        = true
      + resource_group_name             = "banking-staging-rg"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 30
      + tags                            = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + tenant_id                       = "52021890-a859-400c-a8e2-62d0c85d5e66"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Deny"
        }
    }

  # module.keyvault.azurerm_monitor_diagnostic_setting.keyvault[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "keyvault" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "banking-stg-kv-bkil9f-diagnostics"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "AuditEvent"
        }
      + enabled_log {
          + category = "AzurePolicyEvaluationDetails"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.keyvault.azurerm_private_endpoint.keyvault[0] will be created
  + resource "azurerm_private_endpoint" "keyvault" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "eastus"
      + name                     = "banking-stg-kv-bkil9f-pe"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "banking-staging-rg"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "default"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "banking-stg-kv-bkil9f-psc"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

  # module.keyvault.azurerm_role_assignment.terraform_admin[0] will be created
  + resource "azurerm_role_assignment" "terraform_admin" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "31ad1e6d-5433-42a4-a4a2-ff2438ada1a4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.keyvault.null_resource.cleanup_keyvault_diagnostics[0] will be created
  + resource "null_resource" "cleanup_keyvault_diagnostics" {
      + id       = (known after apply)
      + triggers = {
          + "diagnostic_name" = "banking-stg-kv-bkil9f-diagnostics"
          + "keyvault_id"     = (known after apply)
        }
    }

  # module.monitoring.azurerm_application_insights.main[0] will be created
  + resource "azurerm_application_insights" "main" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = 10
      + daily_data_cap_notifications_disabled = false
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "eastus"
      + name                                  = "banking-staging-ai"
      + resource_group_name                   = "banking-staging-rg"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + workspace_id                          = (known after apply)
    }

  # module.monitoring.azurerm_log_analytics_solution.container_insights[0] will be created
  + resource "azurerm_log_analytics_solution" "container_insights" {
      + id                    = (known after apply)
      + location              = "eastus"
      + resource_group_name   = "banking-staging-rg"
      + solution_name         = "ContainerInsights"
      + tags                  = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + workspace_name        = "banking-staging-law"
      + workspace_resource_id = (known after apply)

      + plan {
          + name      = (known after apply)
          + product   = "OMSGallery/ContainerInsights"
          + publisher = "Microsoft"
        }
    }

  # module.monitoring.azurerm_log_analytics_workspace.main will be created
  + resource "azurerm_log_analytics_workspace" "main" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = 10
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "eastus"
      + name                            = "banking-staging-law"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "banking-staging-rg"
      + retention_in_days               = 60
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + workspace_id                    = (known after apply)
    }

  # module.monitoring.azurerm_monitor_action_group.critical will be created
  + resource "azurerm_monitor_action_group" "critical" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "banking-staging-critical-ag"
      + resource_group_name = "banking-staging-rg"
      + short_name          = "Critical"
      + tags                = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
    }

  # module.monitoring.azurerm_monitor_action_group.warning will be created
  + resource "azurerm_monitor_action_group" "warning" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "banking-staging-warning-ag"
      + resource_group_name = "banking-staging-rg"
      + short_name          = "Warning"
      + tags                = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
    }

  # module.monitoring.azurerm_monitor_scheduled_query_rules_alert_v2.container_restarts[0] will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "container_restarts" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Alert when containers are restarting frequently"
      + enabled                                = true
      + evaluation_frequency                   = "PT5M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "eastus"
      + name                                   = "banking-staging-container-restarts-alert"
      + resource_group_name                    = "banking-staging-rg"
      + scopes                                 = (known after apply)
      + severity                               = 2
      + tags                                   = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = (known after apply)
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                KubePodInventory
                | where TimeGenerated > ago(15m)
                | where PodRestartCount > 5
                | summarize RestartCount = sum(PodRestartCount) by Name, Namespace
                | where RestartCount > 10
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # module.monitoring.azurerm_monitor_scheduled_query_rules_alert_v2.error_logs[0] will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "error_logs" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Alert when there are many application errors"
      + enabled                                = true
      + evaluation_frequency                   = "PT5M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "eastus"
      + name                                   = "banking-staging-error-logs-alert"
      + resource_group_name                    = "banking-staging-rg"
      + scopes                                 = (known after apply)
      + severity                               = 2
      + tags                                   = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = (known after apply)
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                AppExceptions
                | where TimeGenerated > ago(15m)
                | summarize ErrorCount = count() by AppRoleName
                | where ErrorCount > 50
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # module.networking.azurerm_network_security_group.aks will be created
  + resource "azurerm_network_security_group" "aks" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "banking-staging-aks-nsg"
      + resource_group_name = "banking-staging-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
    }

  # module.networking.azurerm_network_security_group.database will be created
  + resource "azurerm_network_security_group" "database" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "banking-staging-db-nsg"
      + resource_group_name = "banking-staging-rg"
      + security_rule       = (known after apply)
      + tags                = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
    }

  # module.networking.azurerm_network_security_rule.aks_deny_all_inbound will be created
  + resource "azurerm_network_security_rule" "aks_deny_all_inbound" {
      + access                      = "Deny"
      + destination_address_prefix  = "*"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "DenyAllInbound"
      + network_security_group_name = "banking-staging-aks-nsg"
      + priority                    = 4096
      + protocol                    = "*"
      + resource_group_name         = "banking-staging-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.networking.azurerm_network_security_rule.aks_https_from_appgw[0] will be created
  + resource "azurerm_network_security_rule" "aks_https_from_appgw" {
      + access                      = "Allow"
      + destination_address_prefix  = "10.1.0.0/22"
      + destination_port_range      = "443"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowHTTPSFromAppGateway"
      + network_security_group_name = "banking-staging-aks-nsg"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "banking-staging-rg"
      + source_address_prefix       = "10.1.5.0/24"
      + source_port_range           = "*"
    }

  # module.networking.azurerm_network_security_rule.aks_https_internal will be created
  + resource "azurerm_network_security_rule" "aks_https_internal" {
      + access                      = "Allow"
      + destination_address_prefix  = "10.1.0.0/22"
      + destination_port_range      = "443"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowHTTPSInternal"
      + network_security_group_name = "banking-staging-aks-nsg"
      + priority                    = 110
      + protocol                    = "Tcp"
      + resource_group_name         = "banking-staging-rg"
      + source_address_prefix       = "VirtualNetwork"
      + source_port_range           = "*"
    }

  # module.networking.azurerm_network_security_rule.db_deny_all_inbound will be created
  + resource "azurerm_network_security_rule" "db_deny_all_inbound" {
      + access                      = "Deny"
      + destination_address_prefix  = "*"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "DenyAllInbound"
      + network_security_group_name = "banking-staging-db-nsg"
      + priority                    = 4096
      + protocol                    = "*"
      + resource_group_name         = "banking-staging-rg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.networking.azurerm_network_security_rule.db_mysql will be created
  + resource "azurerm_network_security_rule" "db_mysql" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_range      = "3306"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "AllowMySQLFromAKS"
      + network_security_group_name = "banking-staging-db-nsg"
      + priority                    = 100
      + protocol                    = "Tcp"
      + resource_group_name         = "banking-staging-rg"
      + source_address_prefix       = "10.1.0.0/22"
      + source_port_range           = "*"
    }

  # module.networking.azurerm_private_dns_zone.acr will be created
  + resource "azurerm_private_dns_zone" "acr" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.azurecr.io"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "banking-staging-rg"
      + tags                                                  = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
    }

  # module.networking.azurerm_private_dns_zone.keyvault will be created
  + resource "azurerm_private_dns_zone" "keyvault" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.vaultcore.azure.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "banking-staging-rg"
      + tags                                                  = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
    }

  # module.networking.azurerm_private_dns_zone.mysql will be created
  + resource "azurerm_private_dns_zone" "mysql" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.mysql.database.azure.com"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "banking-staging-rg"
      + tags                                                  = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
    }

  # module.networking.azurerm_private_dns_zone.sql will be created
  + resource "azurerm_private_dns_zone" "sql" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.database.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "banking-staging-rg"
      + tags                                                  = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
    }

  # module.networking.azurerm_private_dns_zone_virtual_network_link.acr will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "acr" {
      + id                    = (known after apply)
      + name                  = "acr-vnet-link"
      + private_dns_zone_name = "privatelink.azurecr.io"
      + registration_enabled  = false
      + resource_group_name   = "banking-staging-rg"
      + tags                  = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.networking.azurerm_private_dns_zone_virtual_network_link.keyvault will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "keyvault" {
      + id                    = (known after apply)
      + name                  = "keyvault-vnet-link"
      + private_dns_zone_name = "privatelink.vaultcore.azure.net"
      + registration_enabled  = false
      + resource_group_name   = "banking-staging-rg"
      + virtual_network_id    = (known after apply)
    }

  # module.networking.azurerm_private_dns_zone_virtual_network_link.mysql will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "mysql" {
      + id                    = (known after apply)
      + name                  = "mysql-vnet-link"
      + private_dns_zone_name = "privatelink.mysql.database.azure.com"
      + registration_enabled  = false
      + resource_group_name   = "banking-staging-rg"
      + tags                  = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.networking.azurerm_private_dns_zone_virtual_network_link.sql will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "sql" {
      + id                    = (known after apply)
      + name                  = "sql-vnet-link"
      + private_dns_zone_name = "privatelink.database.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "banking-staging-rg"
      + tags                  = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.networking.azurerm_subnet.aks will be created
  + resource "azurerm_subnet" "aks" {
      + address_prefixes                               = [
          + "10.1.0.0/22",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "banking-staging-aks-subnet"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "banking-staging-rg"
      + service_endpoints                              = [
          + "Microsoft.ContainerRegistry",
          + "Microsoft.KeyVault",
          + "Microsoft.Sql",
          + "Microsoft.Storage",
        ]
      + virtual_network_name                           = "banking-staging-vnet"
    }

  # module.networking.azurerm_subnet.application_gateway[0] will be created
  + resource "azurerm_subnet" "application_gateway" {
      + address_prefixes                               = [
          + "10.1.5.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "banking-staging-appgw-subnet"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "banking-staging-rg"
      + virtual_network_name                           = "banking-staging-vnet"
    }

  # module.networking.azurerm_subnet.database will be created
  + resource "azurerm_subnet" "database" {
      + address_prefixes                               = [
          + "10.1.4.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "banking-staging-db-subnet"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "banking-staging-rg"
      + service_endpoints                              = [
          + "Microsoft.Sql",
        ]
      + virtual_network_name                           = "banking-staging-vnet"

      + delegation {
          + name = "mysql-flexible"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.DBforMySQL/flexibleServers"
            }
        }
    }

  # module.networking.azurerm_subnet.private_endpoints will be created
  + resource "azurerm_subnet" "private_endpoints" {
      + address_prefixes                               = [
          + "10.1.6.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "banking-staging-pe-subnet"
      + private_endpoint_network_policies              = "Disabled"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "banking-staging-rg"
      + virtual_network_name                           = "banking-staging-vnet"
    }

  # module.networking.azurerm_subnet_network_security_group_association.aks will be created
  + resource "azurerm_subnet_network_security_group_association" "aks" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.networking.azurerm_subnet_network_security_group_association.database will be created
  + resource "azurerm_subnet_network_security_group_association" "database" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.networking.azurerm_virtual_network.main will be created
  + resource "azurerm_virtual_network" "main" {
      + address_space       = [
          + "10.1.0.0/16",
        ]
      + dns_servers         = []
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "banking-staging-vnet"
      + resource_group_name = "banking-staging-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
    }

  # module.resource_group.azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "banking-staging-rg"
      + tags     = {
          + "CostCenter"  = "staging"
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "devops@company.com"
          + "Project"     = "banking"
        }
    }

Plan: 45 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + acr_login_server                       = (known after apply)
  + aks_cluster_name                       = "banking-staging-aks"
  + aks_private_fqdn                       = (known after apply)
  + application_insights_connection_string = (sensitive value)
  + get_credentials_command                = "az aks get-credentials --resource-group banking-staging-rg --name banking-staging-aks"
  + keyvault_uri                           = (known after apply)
  + log_analytics_workspace_id             = (known after apply)
  + resource_group_name                    = "banking-staging-rg"

```

</details>

---
*Triggered by @boateng0303 | Workflow: `Terraform Pull Request Validation` | [View Logs](https://github.com/boateng0303/aks-prod-grade-banking-infra/actions/runs/23418794177)*